In [103]:
import pandas as pd

In [104]:
top_100 = pd.read_csv("dataset/top_100_movies.csv")
top_5 = pd.read_csv("dataset/top_5_movies.csv")

In [105]:
top_100.head()

,Unnamed: 0,Rank,Title,Studio,Total Gross,Theaters,Opening,Opening Theaters,Year,link
0,0,1,Home Alone,Fox,"$285,761,243","2,173","$17,081,997","1,202",1990,/movies/?id=homealone.htm
1,0,2,Ghost,Par.,"$217,631,306","1,766","$12,191,540","1,101",1990,/movies/?id=ghost.htm
2,0,3,Dances with Wolves,Orion,"$184,208,848","1,636","$598,257",14,1990,/movies/?id=danceswithwolves.htm
3,0,4,Pretty Woman,BV,"$178,406,268","1,811","$11,280,591","1,325",1990,/movies/?id=prettywoman.htm
4,0,5,Teenage Mutant Ninja Turtles,NL,"$135,265,915","2,377","$25,398,367","2,006",1990,/movies/?id=teenagemutantninjaturtles.htm

In [106]:
# Remove unwanted columns
studio_100 = top_100.drop(['Rank', 'Title', 'Unnamed: 0', 'Theaters', 'Opening', 'Opening Theaters', 'link'], axis=1)

In [123]:
df = studio_100.groupby(["Year", "Studio"]).count()
df

              Total Gross
Year Studio
1990 BV                16
     Col.               8
     Fox               10
     Gold.              1
     MGM                3
     Mira.              2
     NL                 3
     Orion              7
     Par.              10
     Sony               1
     TriS               7
     Triu               4
     UA                 1
     Uni.              14
     WB                13
1991 BV                17
     Col.               7
     Fox               10
     Istr               1
     MGM                3
     Mira.              2
     NL                 4
     Orion              4
     Par.              14
     TriS               8
     Uni.              16
     WB                14
1992 BV                16
     Col.              10
     Fox               14
...                   ...
2016 SGem               2
     STX                2
     Sony               9
     TriS               2
     Uni.              16
     WB                 9
     WB (NL)            7
     Wein.              1
2017 A24                2
     Aviron             1
     BST                1
     BV                 7
     ENTMP              2
     Focus              3
     Fox               12
     FoxS               3
     LG/S               4
     LGF                7
     Neon               1
     ORF                2
     PNT                1
     Par.               8
     SGem               2
     STX                5
     Sony               8
     TriS               2
     Uni.              12
     WB                10
     WB (NL)            5
     Wein.              2

[479 rows x 1 columns]

In [107]:
# Remove commas and dollars signs
studio_100["Total Gross"] = studio_100["Total Gross"].str.replace(",", "")
studio_100["Total Gross"] = studio_100["Total Gross"].str.replace("$", "")
studio_100["Total Gross"] = studio_100["Total Gross"].astype(int)
studio_100.head()

  Studio  Total Gross  Year
0    Fox    285761243  1990
1   Par.    217631306  1990
2  Orion    184208848  1990
3     BV    178406268  1990
4     NL    135265915  1990

In [108]:
# Get total gross for each studio per year
grouped_100 = studio_100.groupby(["Year", "Studio"]).sum()

In [109]:
# Save the csv file
grouped_100.to_csv('dataset/grouped_studio_year.csv')

In [116]:
# Get total gross for the entire year
yearly_gross = grouped_100.groupby(['Year']).sum()
yearly_gross.to_csv('dataset/yearly_gross.csv')

In [118]:
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy import create_engine, MetaData
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, Numeric, Text, Float

In [121]:
# Create an engine to a SQLite database file called `customers.sqlite`
engine = create_engine("sqlite:///dataset/yearly_gross.sqlite")

In [122]:
# Create a connection to the engine called `conn`
conn = engine.connect()